Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface ?
  Dialer            Dialer interface
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Port-channel      Ethernet Channel of interfaces
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  range             interface range command
Router(config)#interface Tu
Router(config)#interface Tunnel 333

Router(config-if)#
%LINK-5-CHANGED: Interface Tunnel333, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 172.16.0.1 255.255.255.0
Router(config-if)#
Router(config-if)#tun
Router(config-if)#tunnel sou
Router(config-if)#tunnel source ?
  Ethernet         IEEE 802.3
  FastEthernet     FastEthernet IEEE 802.3
  GigabitEthernet  GigabitEthernet IEEE 802.3z
  Loopback         Loopback interface
  Serial           Serial
Router(config-if)#tunnel source gi
Router(config-if)#tunnel source gigabitEthernet 0/0/1
Router(config-if)#
Router(config-if)#tun
Router(config-if)#tunnel des
Router(config-if)#tunnel destination 7.7.7.1
Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Tunnel333, changed state to up

Router(config-if)#
Router(config-if)#ex
Router(config)#do wr
Building configuration...
[OK]
Router(config)#ip route ?
  A.B.C.D  Destination prefix
Router(config)#ip route 192.168.145.0 255.255.255.0 ?
  A.B.C.D          Forwarding router's address
  Dialer           Dialer interface
  Ethernet         IEEE 802.3
  FastEthernet     FastEthernet IEEE 802.3
  GigabitEthernet  GigabitEthernet IEEE 802.3z
  Loopback         Loopback interface
  Null             Null interface
  Serial           Serial
  Vlan             Catalyst Vlans
Router(config)#ip route 192.168.145.0 255.255.255.0 172.16.0.2
Router(config)#
Router(config)#do sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     5.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       5.5.5.0/24 is directly connected, GigabitEthernet0/0/1
L       5.5.5.1/32 is directly connected, GigabitEthernet0/0/1
     6.0.0.0/24 is subnetted, 1 subnets
O       6.6.6.0/24 [110/2] via 5.5.5.2, 00:17:08, GigabitEthernet0/0/1
     7.0.0.0/24 is subnetted, 1 subnets
O       7.7.7.0/24 [110/2] via 5.5.5.2, 00:17:08, GigabitEthernet0/0/1
     8.0.0.0/24 is subnetted, 1 subnets
O       8.8.8.0/24 [110/2] via 5.5.5.2, 00:17:08, GigabitEthernet0/0/1
     10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       10.1.1.0/24 is directly connected, GigabitEthernet0/0/0
L       10.1.1.1/32 is directly connected, GigabitEthernet0/0/0
     172.16.0.0/16 is variably subnetted, 2 subnets, 2 masks
C       172.16.0.0/24 is directly connected, Tunnel333
L       172.16.0.1/32 is directly connected, Tunnel333
S    192.168.145.0/24 [1/0] via 172.16.0.2

Router(config)#do wr
Building configuration...
[OK]
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
